{
	"success": true,
	"data": [
		{
			"id": 13,
			"status": "active",
			"project_title": "NetPractice",
			"introduction": [
				"- Remain polite, courteous, respectful, and constructive throughout the evaluation process. The community's well-being depends on it.",
				"- Work with the student or group being evaluated to identify potential issues in their project. Take time to discuss and debate the problems identified.",
				"- Understand that there may be differences in how peers interpret the project instructions and scope. Always keep an open mind and grade as honestly as possible. Pedagogy is effective only when peer evaluations are taken seriously."
			],
			"guidelines": [
				"- Only grade the work submitted to the **Git repository** of the evaluated student or group.",
				"- Double-check that the **Git repository** belongs to the student(s) and that the project is the one expected. Ensure that **git clone** is used in an empty folder.",
				"- Carefully verify that no malicious aliases are used to deceive the evaluator into grading non-official content.",
				"- If applicable, review any **scripts** used for testing or automation together with the student.",
				"- If you haven’t completed the assignment you’re evaluating, read the entire subject before starting the evaluation.",
				"- Use the available flags to report an empty repository, a non-functioning program, a **Norm** error, or cheating. The evaluation process ends with a final grade of 0 (or -42 for cheating). However, except in cases of cheating, students are encouraged to review the work together to identify mistakes to avoid in the future.",
				"- Remember that no **segfaults** or other unexpected program terminations will be tolerated during the evaluation. If this occurs, the final grade is 0. Use the appropriate flag.",
				"- You should not need to edit any files except the configuration file, if it exists. If editing a file is necessary, explain the reasons to the evaluated student and ensure mutual agreement.",
				"- Verify the absence of **memory leaks.** All memory allocated on the heap must be properly freed before the program ends.",
				"- You may use tools like leaks, **valgrind,** or **e_fence** to check for memory leaks. If memory leaks are found, tick the appropriate flag."
			],
			"attachments": [
					{
							"title": "subject_en.pdf",
							"url": "en.subject.pdf"
					},
					{
							"title": "subject_fr.pdf",
							"url": "fr.subject.pdf"
					},
					{
							"title": "net_practice.1.4.tgz",
							"url": "https://github.com/ARuzgar/42-Subjects/blob/main/Cursus/NetPractice/Extras/net_practice.1.4.tgz"
					}
			],
			"preliminarySections" : [
				{
					"title": "Simple preliminaries",
					"subtitle": "If cheating is suspected, the evaluation stops here. Use the \"Cheat\" flag of the scale. Please do this calmly, wisely and use this button with caution.",
					"description": "--Defense can only happen if the student being evaluated is present. This way everybody improves: by exchanging ideas and - sharing knowledge with each other.\n--Nothing submitted (or wrong file or directory) means 0, and the evaluation process ends.\n--In order to grade your peer, you have to clone their Git repository on your machine.",
					"conclusion": "",
					"yes_no": true
				},
				{
					"title": "General instructions",
					"subtitle": "",
					"description": "--Ensure that 10 files (1 per level) are present at the root of the repository. Ensure that they are not empty.",
					"conclusion": "",
					"yes_no": true
				}
			],
			"mandatorySections": [
				{
					"title": "Level 1",
					"subtitle": "- This project is about configuring small-scale networks that have issues to make them run. You have to download the file attached to the project's page (the evaluated student can show you where it is). Then, run the index.html file. A page will open in your web browser. Leave the login field empty to start the 'correction' mode. The evaluated student must solve correctly all of the levels in 15 minutes maximum. Using internet or any external resource to find answers is, of course, forbidden. The use of a simple calculator such as \"bc\" is tolerated but it will be the limit. You can ask questions about the different levels to the evaluated student.",
					"description": "If something does not work as expected or is not clearly explained, the evaluation process ends now.",
					"conclusion": "",
					"yes_no": true
				},
				{
					"title": "Level 2",
					"subtitle": "",
					"description": "If something does not work as expected or is not clearly explained, the evaluation process ends now.",
					"conclusion": "",
					"yes_no": true
				},
				{
					"title": "Level 3",
					"subtitle": "",
					"description": "If something does not work as expected or is not clearly explained, the evaluation process ends now.",
					"conclusion": "",
					"yes_no": true
				}
			],
			"bonusSections": null,
			"cursus_id": "1",
			"updated_at": "2023-07-31T22:00:00.000Z",
			"students": 1,
			"eval_points": 3,
			"time": 45,
			"gradingOptions": [
				{
					"ok": true,
					"outstanding": true,
					"empty_work": true,
					"incomplete_work": true,
					"invalid_compilation": true,
					"norme": true,
					"cheat": true,
					"crash": true,
					"concerning_situations": true,
					"leaks": true,
					"forbidden_functions": true,
					"cannot_support": false
				}
			]
		}
	],
	"message": "Sheets added successfully"
}